{
	"introduction": {
		"parent": "Introduction",
		"children": [{"name":"Background"},
					 {"name":"About the PDDQ Framework"},
					 {"name":"Audience"},
					 {"name":"PDDQ Framework"},
					 {"name":"Framework Organization"}]
	},

	"data-governance": {
		"parent": "Data Governance",
		"children": [{"name":"Governance Management",
					  "evaluation": [{"tier":"1",
					  				  "questions":[{"number":"1.1",
					  				  				"content":"Is a data governance structure defined and established with roles, responsibilities, and accountability assigned to all supplying and consuming business units involved in activities and decisions about patient demographic data?"}]},
					  				 {"tier":"2",
					  				  "questions":[{"number":"2.1",
					  				  				"content":"Does data governance follow defined policies and processes?"}]},
					  				 {"tier":"3",
					  				  "questions":[{"number":"3.1",
					  				  				"content":"Does data governance define and approve appropriate metrics to evaluate the effectiveness of quality improvements to patient demographic data?"},
					  				  			   {"number":"3.2",
					  				  			    "content":"Is training in data governance processes available and required for participating stakeholders?"}]}]},

					 {"name":"Data Management Function",
					  "evaluation": [{"tier":"1",
					  				  "questions":[{"number":"1.1",
					  				  				"content":"Has the organization designated a resource responsible for standards, processes, and communication about patient demographic data?"}]},
					  				 {"tier":"2",
					  				  "questions":[{"number":"2.1",
					  				  				"content":"Has the organization established a data management role responsible for ensuring the continuity and integration of key activities for managing patient demographic data?"}]},
					  				 {"tier":"3",
					  				  "questions":[{"number":"3.1",
					  				  				"content":"Has the organization leveraged the data management function to create standard processes for the management of patient demographic data with governance engagement and approval?"}]}]},

					 {"name":"Communication",
					  "evaluation": [{"tier":"1",
					  				  "questions":[{"number":"1.1",
					  				  				"content":"Does the organization have a communications plan for informing internal and external stakeholders about policies, processes, procedures, and decisions impacting patient demographic data?"}]},
					  				 {"tier":"2",
					  				  "questions":[{"number":"2.1",
					  				  				"content":"How does the organization ensure that communications reach and appropriately inform the intended audience?"}]},
					  				 {"tier":"3",
					  				  "questions":[{"number":"3.1",
					  				  				"content":"Does the organization provide effective communications across the entire lifecycle of patient demographic data?"}]}]},

					 {"name":"Business Glossary, Metadata, and Data Standards",
					  "evaluation": [{"tier":"1",
					  				  "questions":[{"number":"1.1",
					  				  				"content":"Has the organization uniquely defined names and definitions for patient demographic business terms?"}]},
					  				 {"tier":"2",
					  				  "questions":[{"number":"2.1",
					  				  				"content":"Is a process to define, manage, use, and maintain the business glossary defined and followed?"}]},
					  				 {"tier":"3",
					  				  "questions":[{"number":"3.1",
					  				  				"content":"Does data governance for the business glossary process stipulate the use of business terms in system requirements and the mapping of business terms to implemented data stores?"},
					  				  			   {"number":"3.2",
					  				  			    "content":"Does the organization conduct impact assessments and obtain governance approval prior to implementing changes to business terms?"},
					  				  			   {"number":"3.3",
					  				  			    "content":"Does the organization participate in industry groups, which address emerging standards and best practices for patient demographic business terms?"}]}]}]
	},

	"data-quality": {
		"parent": "Data Quality",
		"children": [{"name":"Data Quality Planning",
					  "evaluation": [{"tier":"1",
					  				  "questions":[{"number":"1.1",
					  				  				"content":"Are all relevant stakeholders involved in determining data quality objectives and success criteria for patient demographic data?"},
					  				  			   {"number":"1.2",
					  				  			    "content":"Does the organization have plans to improve data quality through the application of quality rules?"}]},
					  				 {"tier":"2",
					  				  "questions":[{"number":"2.1",
					  				  				"content":"Has the organization established policies, processes, and guidelines to implement the data quality plan?"},
					  				  			   {"number":"2.2","content":"Is the data quality plan regularly monitored to evaluate progress?"}]},
					  				 {"tier":"3",
					  				  "questions":[{"number":"3.1",
					  				  				"content":"Has the organization defined roles, responsibilities, and accountability for data quality governance and management of data quality processes?"}]}]},

					 {"name":"Data Profiling",
					  "evaluation": [{"tier":"1",
					  				  "questions":[{"number":"1.1",
					  				  				"content":"Has the organization profiled patient demographic data?"}]},
					  				 {"tier":"2",
					  				  "questions":[{"number":"2.1",
					  				  				"content":"Has the organization defined an approach and method for profiling a data set?"},
					  				  			   {"number":"2.2",
					  				  			    "content":"Are defects and anomalies identified through data profiling, and are resulting recommendations for remediation reported to stakeholders?"}]},
					  				 {"tier":"3",
					  				  "questions":[{"number":"3.1",
					  				  				"content":"Has data governance approved the set of patient demographic data attributes and sources for regular profiling and monitoring?"},
					  				  			   {"number":"3.2",
					  				  			    "content":"Has the organization developed standard data profiling tools, metrics, and result report templates?"}]}]},

					 {"name":"Data Quality Assessment",
					  "evaluation": [{"tier":"1",
					  				  "questions":[{"number":"1.1",
					  				  				"content":"Does the organization engage business representatives to determine fitness for purpose and quality criteria for patient demographic data?"}]},
					  				 {"tier":"2",
					  				  "questions":[{"number":"2.1",
					  				  				"content":"Are objectives, targets, and thresholds expressed in terms of selected data quality dimensions for patient demographic data attributes?"},
					  				  			   {"number":"2.2",
					  				  			    "content":"Does the organization engage data governance for input on the selection and prioritization of attributes to be assessed?"},
					  				  			   {"number":"2.3",
					  				  			    "content":"Do data quality assessment activities produce new or modified quality rules for patient demographic data?"}]},
					  				 {"tier":"3",
					  				  "questions":[{"number":"3.1",
					  				  				"content":"Does the organization conduct periodic assessments of the selected data sets in accordance with patient demographic data quality policies?"}]}]},

					 {"name":"Data Cleansing and Improvement",
					  "evaluation": [{"tier":"1",
					  				  "questions":[{"number":"1.1",
					  				  				"content":"Are data cleansing requirements derived from the results of data profiling or data quality assessments?"}]},
					  				 {"tier":"2",
					  				  "questions":[{"number":"2.1",
					  				  				"content":"Does the organization evaluate and improve business processes to prevent repeatedly cleansing the same patient demographic data?"}, 
					  				  			   {"number":"2.2",
					  				  			    "content":"Are cleansing activities for patient demographic data evaluated according to business and technical impacts?"}, 
					  				  			   {"number":"2.3",
					  				  			    "content":"Is a history of patient demographic data changes resulting from cleansing activities maintained?"}, 
					  				  			   {"number":"2.4",
					  				  			    "content":"Does the organization have a policy and processes to ensure that patient demographic data is modified at the point of origination in accordance with quality rules?"}]},
					  				 {"tier":"3",
					  				  "questions":[{"number":"3.1",
					  				                "content":"Are patient data cleansing rules applied consistently across the patient demographic data lifecycle?"}]}]}

					 ]		
	},

	"data-operations": {
		"parent": "Data Operations",
		"children": [{"name":"Data Requirements Definition",
					  "evaluation": [{"tier":"1",
					  				  "questions":[{"number":"1.1",
					  				  				"content":"When data requirements are developed, are they expressed using standard business terms consistent with the organization’s business glossary?"}]},
					  				 {"tier":"2",
					  				  "questions":[{"number":"2.1",
					  				  				"content":"Is a data requirements definition process for patient demographic data documented and followed?"},
					  				  			   {"number":"2.2",
					  				  			    "content":"Are data requirements aligned with internal (or external) data model(s) and other related artifacts?"}]},
					  				 {"tier":"3",
					  				  "questions":[{"number":"3.1",
					  				  				"content":"Do data requirements utilize standard definitions, ranges, and values for patient registration data?"},
					  				  			   {"number":"3.2",
					  				  				"content":"When data requirements are documented, are they mapped to the business processes that create and modify the data?"}]}]},

					 {"name":"Data Lifecycle Management",
					  "evaluation": [{"tier":"1",
					  				  "questions":[{"number":"1.1",
					  				  				"content":"Is the patient demographic data lifecycle for key business processes defined and understood by stakeholders?"}]},
					  				 {"tier":"2",
					  				  "questions":[{"number":"2.1",
					  				  				"content":"Do producers and consumers of patient demographic data apply consistent criteria when selecting approved authoritative sources?"}]},
					  				 {"tier":"3",
					  				  "questions":[{"number":"3.1",
					  				  				"content":"Are stakeholder requirements for patient demographic data mapped and aligned to an approved data lifecycle scope?"},
					  				  			   {"number":"3.2",
					  				  			    "content":"Does the organization maintain and periodically review business process to data mapping?"}]}]},

					 {"name":"Data Provider Management",
					  "evaluation": [{"tier":"1",
					  				  "questions":[{"number":"1.1",
					  				  				"content":"Has the organization applied requirements for patient demographic data to data sourcing specifications and agreements?"}]},
					  				 {"tier":"2",
					  				  "questions":[{"number":"2.1",
					  				  				"content":"Are data quality rules and thresholds embedded into service level agreements with data providers?"}]},
					  				 {"tier":"3",
					  				  "questions":[{"number":"3.1",
					  				  				"content":"Is there a process to hold providers accountable for defects and deviations from data quality thresholds defined in the service level agreement?"}]}]}
					 ]		
	},


	"platform-and-standards": {
		"parent": "Platform and Standards",
		"children": [{"name":"Data Standards",
					  "evaluation": [{"tier":"1",
					  				  "questions":[{"number":"1.1",
					  				  				"content":"Are data standards, such as data representations, security, access, and provisioning, defined and followed?"}]},
					  				 {"tier":"2",
					  				  "questions":[{"number":"2.1",
					  				  				"content":"Are data standards reviewed with business stakeholders and approved by data governance?"}]},
					  				 {"tier":"3",
					  				  "questions":[{"number":"3.1",
					  				  				"content":"Does the organization align its data store designs, the exchange of data, and data access permissions with selected standards?"},
					  				  			   {"number":"3.2",
					  				  				"content":"Is the organization aware of and selectively implementing external standards relevant to patient demographic data?"}]}]},

					 {"name":"Data Management Platform",
					  "evaluation": [{"tier":"1",
					  				  "questions":[{"number":"1.1",
					  				  				"content":"Has the organization developed data requirements and quality rules for the selection, construction, or enhancement of its data management platform?"}]},
					  				 {"tier":"2",
					  				  "questions":[{"number":"2.1",
					  				  				"content":"Does the platform selected to manage patient demographic data support security, privacy, and access requirements?"}]},
					  				 {"tier":"3",
					  				  "questions":[{"number":"3.1",
					  				  				"content":"Does the platform design and its capabilities support workflow and service levels required across the patient demographic data lifecycle?"}]}]},

					 {"name":"Data Integration",
					  "evaluation": [{"tier":"1",
					  				  "questions":[{"number":"1.1",
					  				  				"content":"Do stakeholders participating in collective decisions about the integration of patient demographic data follow a standard approach based on data needs and priorities?"}]},
					  				 {"tier":"2",
					  				  "questions":[{"number":"2.1",
					  				  				"content":"Does the organization apply quality rules to the integration of patient demographic data from multiple sources?"}]},
					  				 {"tier":"3",
					  				  "questions":[{"number":"3.1",
					  				  				"content":"Are changes to data sources, quality rules, and destinations documented and approved by all relevant stakeholders?"}]}]},

					{"name":"Historical Data, Archiving, and Retention",
					  "evaluation": [{"tier":"1",
					  				  "questions":[{"number":"1.1",
					  				  				"content":"Is historical patient demographic data available to support patient identity integrity?"}]},
					  				 {"tier":"2",
					  				  "questions":[{"number":"2.1",
					  				  				"content":"Does the organization retain patient demographic data according to established criteria?"}]},
					  				 {"tier":"3",
					  				  "questions":[{"number":"3.1",
					  				  				"content":"Are all stakeholders who create or modify patient demographic data aware of and conforming to historical and retention policies?"}]}]}
					 ]		
	},


	"supporting-processes": {
		"parent": "Supporting Processes",
		"children": [{"name":"Measurement and Analysis",
					  "evaluation": [{"tier":"1",
					  				  "questions":[{"number":"1.1",
					  				  				"content":"Has the organization developed measurement objectives for quality improvements to patient demographic data?"}]},
					  				 {"tier":"2",
					  				  "questions":[{"number":"2.1",
					  				  				"content":"Has the organization established a baseline of patient demographic data measurements?"}]},
					  				 {"tier":"3",
					  				  "questions":[{"number":"3.1",
					  				  				"content":"Does the organization communicate results of measurement, analysis, and interpretation to all relevant stakeholders?"}]}]},

					 {"name":"Process Management",
					  "evaluation": [{"tier":"1",
					  				  "questions":[{"number":"1.1",
					  				  				"content":"Does the organization address improvement opportunities for business processes that impact patient demographic data?"}]},
					  				 {"tier":"2",
					  				  "questions":[{"number":"2.1",
					  				  				"content":"Are process assets such as documented processes, procedures, templates and guidelines maintained and available to all relevant stakeholders?"}]},
					  				 {"tier":"3",
					  				  "questions":[{"number":"3.1",
					  				  				"content":"Are processes periodically reviewed for effectiveness based on an evaluation of costs, benefits, and other factors in order to incorporate suggestions for positive changes?"}]}]},

					 {"name":"Process Quality Assurance",
					  "evaluation": [{"tier":"1",
					  				  "questions":[{"number":"1.1",
					  				  				"content":"Are issues with data management processes and work products identified and addressed in the context of the entire patient demographic data lifecycle?"}]},
					  				 {"tier":"2",
					  				  "questions":[{"number":"2.1",
					  				  				"content":"Are selected data management processes and corresponding work products objectively evaluated against process descriptions, standards, and procedures?"},
					  				  			   {"number":"2.2",
					  				  			    "content":"Are quality issues with processes and work products communicated to stakeholders and are noncompliance issues resolved?"}]},
					  				 {"tier":"3",
					  				  "questions":[{"number":"3.1",
					  				  				"content":"Does the organization maintain and apply standard measures and metrics to process quality issues?"}]}]}
					 ]		
	}

}